<font color ='blue' size =20> Introduction to Pandas</font>

In [30]:
import pandas as pd

<font color= 'blue' size = 15> Introduction to pandas Data Structures </font>

pandas has two main data structures  namely, Series and DataFrames.

<font color ='blue' size =10>Pandas Series</font>

pandas Series one-dimensional labeled array.

In [31]:
ser = pd.Series(data=[100, 200, 300, 400, 500], index=['tom', 'bob', 'nancy', 'dan', 'eric'])

In [32]:
ser

tom      100
bob      200
nancy    300
dan      400
eric     500
dtype: int64

Index can be used to print of indices

In [33]:
ser.index

Index(['tom', 'bob', 'nancy', 'dan', 'eric'], dtype='object')

Value of a index can be fetched by specifying key

In [34]:
ser['nancy']

300

List of indices should be specified to get key and value pair

In [35]:
ser[[4,3,1]]

eric    500
dan     400
bob     200
dtype: int64

We can check if a particular key is present in the list of keys as shown below

In [36]:
'bob' in ser

True

<font color ='blue' size =15>pandas Dataframes </font>

pandas dataframe is a 2-dimensional labelled data structure

<font color ='blue' size =5> Create dataframe from dictionary of python series </font>

In [37]:
d = {'one' : pd.Series([100., 200., 300.], index=['apple', 'ball', 'clock']),
     'two' : pd.Series([111., 222., 333., 4444.], index=['apple', 'ball', 'cerill', 'dancy'])}

In [38]:
df = pd.DataFrame(d)
print(df)

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [39]:
df.index

Index(['apple', 'ball', 'cerill', 'clock', 'dancy'], dtype='object')

In [40]:
df.columns

Index(['one', 'two'], dtype='object')

To print particular rows use following

In [41]:
pd.DataFrame(d, index=['dancy', 'ball', 'apple'])

         one     two
dancy    NaN  4444.0
ball   200.0   222.0
apple  100.0   111.0

To specify columns use the following

In [42]:
pd.DataFrame(d, index=['dancy', 'ball', 'apple'], columns=['two', 'five'])

          two five
dancy  4444.0  NaN
ball    222.0  NaN
apple   111.0  NaN

<font color ='blue' size =5>Create dataframe from a list of python dictionaries</font>

In [43]:
data = [{'alex': 1, 'joe': 2}, {'ema': 5, 'dora': 10, 'alice': 20}]

In [44]:
pd.DataFrame(data)

   alex  joe  ema  dora  alice
0   1.0  2.0  NaN   NaN    NaN
1   NaN  NaN  5.0  10.0   20.0

In [45]:
pd.DataFrame(data, index=['orange', 'red'])

        alex  joe  ema  dora  alice
orange   1.0  2.0  NaN   NaN    NaN
red      NaN  NaN  5.0  10.0   20.0

In [46]:
pd.DataFrame(data, columns=['joe', 'dora','alice'])

   joe  dora  alice
0  2.0   NaN    NaN
1  NaN  10.0   20.0

<font color ='blue' size =5> Basic dataframe operations </font>

In [47]:
df

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [48]:
df['one']

apple     100.0
ball      200.0
cerill      NaN
clock     300.0
dancy       NaN
Name: one, dtype: float64

New column can be computed as shown below

In [49]:
df['three'] = df['one'] * df['two']
df

          one     two    three
apple   100.0   111.0  11100.0
ball    200.0   222.0  44400.0
cerill    NaN   333.0      NaN
clock   300.0     NaN      NaN
dancy     NaN  4444.0      NaN

In [50]:
df['flag'] = df['one'] > 250
df

          one     two    three   flag
apple   100.0   111.0  11100.0  False
ball    200.0   222.0  44400.0  False
cerill    NaN   333.0      NaN  False
clock   300.0     NaN      NaN   True
dancy     NaN  4444.0      NaN  False

In [51]:
three = df.pop('three')

In [52]:
three

apple     11100.0
ball      44400.0
cerill        NaN
clock         NaN
dancy         NaN
Name: three, dtype: float64

In [53]:
df

          one     two   flag
apple   100.0   111.0  False
ball    200.0   222.0  False
cerill    NaN   333.0  False
clock   300.0     NaN   True
dancy     NaN  4444.0  False

A column can be deleted using del

In [54]:
del df['two']

In [55]:
df

          one   flag
apple   100.0  False
ball    200.0  False
cerill    NaN  False
clock   300.0   True
dancy     NaN  False

A column can be inserted using insert fumction

In [56]:
df.insert(2, 'copy_of_one', df['one'])
df

          one   flag  copy_of_one
apple   100.0  False        100.0
ball    200.0  False        200.0
cerill    NaN  False          NaN
clock   300.0   True        300.0
dancy     NaN  False          NaN

In [57]:
df['one_upper_half'] = df['one'][:2]
df

          one   flag  copy_of_one  one_upper_half
apple   100.0  False        100.0           100.0
ball    200.0  False        200.0           200.0
cerill    NaN  False          NaN             NaN
clock   300.0   True        300.0             NaN
dancy     NaN  False          NaN             NaN